In [5]:
from ravenclaw.wrangling import join_wisely
from ravenclaw.example_dataframes import lotr

In [4]:
example_dataframes

In [6]:
df1 = lotr

In [11]:
df1 = lotr.drop(labels=[0, 1])
df2 = lotr.drop(labels=[2, 3])

In [12]:
df1

   number  firstname lastname        date
2       2    Gandalf     None  2018-06-07
3       3    Legolas     None  2018-06-08
4       4    Saruman     None  2018-06-09
5       5      Bilbo  Baggins  2018-06-10
6       6     Gollum     None  2018-06-11
7       7      Arwen     None  2018-06-12
8       8  Galadriel     None  2018-06-13
9       9    Boromir     None  2018-06-14

In [13]:
df2

   number  firstname lastname        date
0       0      Frodo  Baggins  2018-06-05
1       1    Aragorn     None  2018-06-06
4       4    Saruman     None  2018-06-09
5       5      Bilbo  Baggins  2018-06-10
6       6     Gollum     None  2018-06-11
7       7      Arwen     None  2018-06-12
8       8  Galadriel     None  2018-06-13
9       9    Boromir     None  2018-06-14

In [14]:
x = join_wisely(left=df1, right=df2, on='number')

{'left_only':    number firstname_x lastname_x      date_x firstname_y lastname_y date_y
 0       2     Gandalf       None  2018-06-07         NaN        NaN    NaN
 1       3     Legolas       None  2018-06-08         NaN        NaN    NaN,
 'right_only':    number firstname_x lastname_x date_x firstname_y lastname_y      date_y
 8       0         NaN        NaN    NaN       Frodo    Baggins  2018-06-05
 9       1         NaN        NaN    NaN     Aragorn       None  2018-06-06,
 'both':    number firstname_x lastname_x      date_x firstname_y lastname_y      date_y
 2       4     Saruman       None  2018-06-09     Saruman       None  2018-06-09
 3       5       Bilbo    Baggins  2018-06-10       Bilbo    Baggins  2018-06-10
 4       6      Gollum       None  2018-06-11      Gollum       None  2018-06-11
 5       7       Arwen       None  2018-06-12       Arwen       None  2018-06-12
 6       8   Galadriel       None  2018-06-13   Galadriel       None  2018-06-13
 7       9     Boromir       None  2018-06-14     Boromir       None  2018-06-14}